Repository: kitsain/Kitsain-Frontend-Spring2023
Catalog: lib/l10n/app_*.arb
Languages: fi

source: Pantry
fi: Ruokakomero

source: Shopping lists
fi: Kauppalistat

# shoppingListsTopBarTitle
source: Shopping lists
fi: Kauppalistat

# history
source: Pantry history
fi: Ruokakomeron historia

# itemCardEditItem
source: Edit item
fi: Muokkaa tuotetta

# itemCardMoveToUsed
source: Move to used
fi: Siirrä käytettyihin

# itemCardMoveToBin
source: Move to bin
fi: Siirrä hävikkiin

# itemCardMoveToPantry
source: Move to pantry
fi: Siirrä ruokakomeroon

# itemCardMoveToShoppingList
source: Move to shopping list
fi: Siirrä kauppalistalle

source: Delete item
fi: Poista tuote

# deleteItemDialogPrompt
source: Are you sure you want to delete this item? This action cannot be undone.
fi: Oletko varma, että haluat poistaa tämän tuotteen? Tätä toimintoa ei voi perua.

source: Cancel
fi: Peru

source: Delete
fi: Poista

# pantryHelpTitle
source: What is pantry?
fi: Mikä on ruokakomero?

# pantryHelpText1
source: In the pantry, you can easily see what items you currently have in your home. You can sort and filter the view with different preferences, making it easy to track down specific items.
fi: Ruokakomero-välilehdellä näkyy, mitä tuotteita kotonasi on tällä hetkellä. Näkymän saa järjestettyä tai suodatettua erilaisilla asetuksilla, mikä helpottaa erilaisten tuotteiden etsimistä.

# pantryHelpText2
source: Open an item card by clicking it and set an expiration and opening day and let Kitsain tell you which items should be used first through color coding. Items without a set expiration date will show up with a grey color code. Easy, right?
fi: Tuotekortin saa avattua painamalla sitä. Kun tuotteelle asetetaan parasta ennen -päiväys ja avauspäivämäärä, Kitsain kertoo värikoodien avulla, milloin eri tuotteet tulisi käyttää. Tuotteet, joiden päiväystä ei ole asetettu, näkyvät harmaina. Helppoa, eikö?

# pantryHelpText3
source: Once you click the plus icon, you can add a new item to your pantry either by hand or by using your phone’s camera as an EAN code scanner. You can edit an item card anytime by tapping it. You can move an item card to a different section via the options icon or by simply dragging it.
fi: Uuden tuotteen saa lisättyä painamalla ylänurkan plus-ikonia. Tuotteen tiedot voi syöttää käsin tai skannaamalla viivakoodin puhelimen kameralla. Kortin tietoja pääsee muokkaamaan milloin vain painamalla korttia. Kortin saa siirrettyä toiseen osioon käyttämällä kortin asetusvalikkoa tai raahamalla kortin haluttuun kohteeseen.

# pantryHelpText4
source: As we all know, best before dates are not absolute. That is why in Kitsain, You are in charge of your pantry and decide when an item is no longer viable for use. Items that have passed their expiration date will show up with a black color code but will stay in the pantry until you mark them either used or bin them.
fi: Kuten kaikki tiedämme, parasta ennen -päiväykset eivät välttämättä aina pidä täysin paikkaansa. Siksi Kitsain-sovelluksessa päätös siitä, milloin tuotetta ei voi enää käyttää, on sovelluksen käyttäjän vastuulla. Tuotteet, joiden päiväys on jo mennyt, näkyvät mustina. Ne säilyvät kuitenkin Ruokakomero-välilehdellä kunnes ne siirretään käytettyjen tai poisheitettyjen tuotteiden joukkoon.

# closeHelpSection
source: Got it
fi: Selvä

# allListsHelpTitle
source: What's in shopping lists?
fi: Miten Kauppalistat-sivu toimii?

# allListsHelpText1
source: In shopping lists, you can manage your grocery shopping. Kitsain shopping lists is connected to Google Tasks so you can access them easily outside of the app.
fi: Kauppalistat-sivulla voi pitää kirjaa ostoksistaan. Kitsain on yhdistetty Google Tasks -sovellukseen, joten listoihin pääsee kätevästi käsiksi myös sovelluksen ulkopuolella.

# allListsHelpText2
source: You can create a new shopping through the icon in the top banner. Items can be either dragged or sent via options into a designated shopping list. The destination list will be indicated with a border.
fi: Uuden listan saa luotua painamalla ikonia sivun ylälaidassa. Tuotteita saa lisättyä listalle raahaamalla tai käyttämällä asetusvalikkoa. Kohtaana oleva lista näkyy korostettuna.

# singleListHelpTitle
source: What can I do with an opened shopping list?
fi: Miten yksittäinen kauppalista toimii?

# singleListHelpText1
source: Once you’ve opened a shopping list, you can manage its contents. While grocery shopping, you can check off items as you go. Once you’re done, you can move all checked items to pantry. This doesn’t remove the items from the shopping list, so you can keep reusing the same list over and over if you want to!
fi: Kauppalistan avaamalla pääsee muokkaamaan sen sisältöä. Ostoksia tehdessä jo kerättyihin tuotteisiin voi lisätä merkinnän. Kun ostokset on tehty, kaikki merkityt tuotteet voi siirtää ruokakomeroon. Tämä ei poista tuotteita kauppalistalta, joten samaa listaa voi käyttää aina uudestaan ja uudestaan!

# singleListHelpText2
source: Add items to the shopping list through the shopping cart icon in the top banner. Then, set a name and an optional description to the item. Don’t worry, other details, like an expiration date can be added after you move it to the pantry.
fi: Tuotteita saa lisättyä kauppalistalle yläpalkin ostoskärryikonin kautta. Samalla tuotteelle asetetaan nimi ja valinnaisesti myös kuvaus. Muita tietoja, kuten päiväyksen, voi lisätä ruokakomeroon lisäämisen jälkeen.

# pantryHistoryHelpTitle
source: What is pantry history?
fi: Miten ruokakomeron historia toimii?

# pantryHistoryHelpText1
source: In pantry history, you can access items that are no longer in your pantry and monthly follow the amount of food waste you’re producing by using the toggle button.
fi: Ruokakomeron historia -sivulla pääsee käsiksi tuotteisiin, jotka eivät enää ole ruokakomerossa. Sivulla voi myös seurata ruokahävikin määrää kuukausittain näkymää vaihtamalla.

# pantryHistoryHelpText2
source: In ‘used’, you can see all items that you’ve marked as used, as well as the percentage of items you used from everything in your pantry in that month. You can copy an item to pantry or a shopping list through the item card options button.
fi: Käytetyt-näkymässä näkyy kaikki käytetyksi merkityt tuotteet sekä näiden prosenttiosuus kaikista historia-sivun tuotteista. Tuotteen saa kopioitua ruokakomeroon tai kauppalistalle tuotekortin asetusvalikosta

# pantryHistoryHelpText3
source: In the bin, you can see the percentage of your household’s food waste. The average household food waste counts for almost 1/3 of all food waste produced globally. Every small bit counts, so in Kitsain, by clicking the percentage, you can set and follow your own realistic goals.
fi: Hävikki-näkymässä näkyy ruokahävikin määrä prosentteina. Keskimääräinen kotitalouksien ruokahävikki tuottaa miltei kolmasosan koko maailman hävikistä. Pienilläkin teoilla on merkitystä, joten Kitsain-sovelluksessa jokainen käyttäjä saa itse asettaa itselleen sopivat tavoitteet.

# pantryHistoryHelpText4
source: If you need tips for how to reduce your household food waste or want to know more of it, you can start by visiting: Harward / sustainability / food waste European Comission / food waste Kuluttajaliitto / ruokahävikki
fi: Lisätietoja ruokahävikistä ja sen vähentämisestä löytyy esimerkiksi seuraavilta sivuilta: Harward / sustainability / food waste European Comission / food waste Kuluttajaliitto / ruokahävikki
